Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70b/atdf/ATSAME70Q20B.atdf
        <register caption="AFEC Write Protection Mode Register" name="AFEC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protect KEY" mask="0xFFFFFF00" name="WPKEY" values="AFEC_WPMR__WPKEY"/>
        </register>
        <register caption="AFEC Write Protection Status Register" name="AFEC_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protect Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protect Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="" name="AFEC_MR__TRGEN">
        <value caption="Hardware triggers are disabled. Starting a conversion is only possible by software." name="DIS" value="0"/>
        <value caption="Hardware trigger selected by TRGSEL field is enabled." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="AFEC_MR__TRGSEL">
        <value caption="AFE0_ADTRG for AFEC0 / AFE1_ADTRG for AFEC1" name="AFEC_TRIG0" value="0x0"/>
        <value caption="TIOA Output of the Timer Counter Channel 0 for AFEC0/TIOA Output of the Timer Counter Channel 3 for AFEC1" name="AFEC_TRIG1" value="0x1"/>
        <value caption="TIOA Output of the Timer Counter Channel 1 for AFEC0/TIOA Output of the Timer Counter Channel 4 for AFEC1" name="AFEC_TRIG2" value="0x2"/>
        <value caption="TIOA Output of the Timer Counter Channel 2 for AFEC0/TIOA Output of the Timer Counter Channel 5 for AFEC1" name="AFEC_TRIG3" value="0x3"/>
        <value caption="PWM0 event line 0 for AFEC0 / PWM1 event line 0 for AFEC1" name="AFEC_TRIG4" value="0x4"/>
        <value caption="PWM0 event line 1 for AFEC0 / PWM1 event line 1 for AFEC1" name="AFEC_TRIG5" value="0x5"/>
        <value caption="Analog Comparator" name="AFEC_TRIG6" value="0x6"/>
      </value-group>
      <value-group caption="" name="AFEC_MR__SLEEP">
        <value caption="Normal mode: The AFE and reference voltage circuitry are kept ON between conversions." name="NORMAL" value="0"/>
        <value caption="Sleep mode: The AFE and reference voltage circuitry are OFF between conversions." name="SLEEP" value="1"/>
      </value-group>
      <value-group caption="" name="AFEC_MR__FWUP">
        <value caption="Normal Sleep mode: The sleep mode is defined by the SLEEP bit." name="OFF" value="0"/>
        <value caption="Fast wake-up Sleep mode: The voltage reference is ON between conversions and AFE is OFF." name="ON" value="1"/>
      </value-group>
      <value-group caption="" name="AFEC_MR__FREERUN">
        <value caption="Normal mode" name="OFF" value="0"/>
        <value caption="Free Run mode: Never wait for any trigger." name="ON" value="1"/>
      </value-group>
      <value-group caption="" name="AFEC_MR__STARTUP">
        <value caption="0 periods of AFE clock" name="SUT0" value="0x0"/>
        <value caption="8 periods of AFE clock" name="SUT8" value="0x1"/>
        <value caption="16 periods of AFE clock" name="SUT16" value="0x2"/>
        <value caption="24 periods of AFE clock" name="SUT24" value="0x3"/>
        <value caption="64 periods of AFE clock" name="SUT64" value="0x4"/>
        <value caption="80 periods of AFE clock" name="SUT80" value="0x5"/>
        <value caption="96 periods of AFE clock" name="SUT96" value="0x6"/>
        <value caption="112 periods of AFE clock" name="SUT112" value="0x7"/>
        <value caption="512 periods of AFE clock" name="SUT512" value="0x8"/>
        <value caption="576 periods of AFE clock" name="SUT576" value="0x9"/>
        <value caption="640 periods of AFE clock" name="SUT640" value="0xA"/>
        <value caption="704 periods of AFE clock" name="SUT704" value="0xB"/>
        <value caption="768 periods of AFE clock" name="SUT768" value="0xC"/>
        <value caption="832 periods of AFE clock" name="SUT832" value="0xD"/>
        <value caption="896 periods of AFE clock" name="SUT896" value="0xE"/>
        <value caption="960 periods of AFE clock" name="SUT960" value="0xF"/>
      </value-group>
      <value-group caption="" name="AFEC_MR__USEQ">
        <value caption="Normal mode: The controller converts channels in a simple numeric order." name="NUM_ORDER" value="0"/>
        <value caption="User Sequence mode: The sequence respects what is defined in AFEC_SEQ1R and AFEC_SEQ1R." name="REG_ORDER" value="1"/>
      </value-group>
      <value-group caption="" name="AFEC_EMR__CMPMODE">
        <value caption="Generates an event when the converted data is lower than the low threshold of the window." name="LOW" value="0x0"/>
        <value caption="Generates an event when the converted data is higher than the high threshold of the window." name="HIGH" value="0x1"/>
        <value caption="Generates an event when the converted data is in the comparison window." name="IN" value="0x2"/>
        <value caption="Generates an event when the converted data is out of the comparison window." name="OUT" value="0x3"/>
      </value-group>
      <value-group caption="" name="AFEC_EMR__RES">
        <value caption="12-bit resolution, AFE sample rate is maximum (no averaging)." name="NO_AVERAGE" value="0x0"/>
        <value caption="13-bit resolution, AFE sample rate divided by 4 (averaging)." name="OSR4" value="0x2"/>
        <value caption="14-bit resolution, AFE sample rate divided by 16 (averaging)." name="OSR16" value="0x3"/>
        <value caption="15-bit resolution, AFE sample rate divided by 64 (averaging)." name="OSR64" value="0x4"/>
        <value caption="16-bit resolution, AFE sample rate divided by 256 (averaging)." name="OSR256" value="0x5"/>
      </value-group>
      <value-group caption="" name="AFEC_EMR__SIGNMODE">
        <value caption="Single-Ended channels: Unsigned conversions.Differential channels: Signed conversions." name="SE_UNSG_DF_SIGN" value="0x0"/>
        <value caption="Single-Ended channels: Signed conversions.Differential channels: Unsigned conversions." name="SE_SIGN_DF_UNSG" value="0x1"/>
        <value caption="All channels: Unsigned conversions." name="ALL_UNSIGNED" value="0x2"/>
        <value caption="All channels: Signed conversions." name="ALL_SIGNED" value="0x3"/>
      </value-group>
      <value-group caption="" name="AFEC_TEMPMR__TEMPCMPMOD">
        <value caption="Generates an event when the converted data is lower than the low threshold of the window." name="LOW" value="0x0"/>
        <value caption="Generates an event when the converted data is higher than the high threshold of the window." name="HIGH" value="0x1"/>
        <value caption="Generates an event when the converted data is in the comparison window." name="IN" value="0x2"/>
        <value caption="Generates an event when the converted data is out of the comparison window." name="OUT" value="0x3"/>
      </value-group>
      <value-group caption="" name="AFEC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x414443"/>
      </value-group>
    </module>
